<template>
  <div>
    <h1>プライバシーポリシー</h1>
    <h2>個人情報の利用目的</h2>
    <p>
      当プライバシーポリシーにおいて、個人情報とは「生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日その他の記述などによって特定の個人を識別できるもの
      （他の情報と容易に照合することができ、それによって特定の個人を識別することができることとなるものを含む。）、
      または個人識別符号が含まれるもの」と定義します。
    </p>
    <p>
      当サイトではTwitterアカウントを使った認証を行うことがあります。
      認証には認証基盤であるAuth0を用いています。
      認証にかかわる情報についてはユーザIDを除き、当サイト内では保管をせず、Auth0が管理をします。
      Auth0のプライバシーポリシーについては
      <a href="https://auth0.com/privacy/">
        こちらのページ(英語)
      </a>
      をご覧ください。
      また、収集するユーザIDについては、当サイト内でのユーザの識別など当サイトの円滑な運営にのみ使用し、
      他の目的で使用することはありません。
    </p>
    <h2>個人情報の第三者への提供</h2>
    <p>
      当サイトでは、個人情報は適切に管理し、以下に該当する場合を除いて第三者に開示することはありません。
    </p>
    <ul>
      <li>本人のご了解がある場合</li>
      <li>法令等への協力のため、開示が必要となる場合</li>
    </ul>
    <p>
      ご本人からの個人データの開示、訂正、追加、削除、利用停止のご希望の場合には、ご本人であることを確認させていただいた上、速やかに対応させていただきます。
    </p>
    <p>
      当サイトでは「Google Adsense」を用いた広告の表示を行うことがあります。
      広告配信事業者は、ユーザーの興味に応じた広告を表示するためにCookie（クッキー）を使用することがあります。Cookie（クッキー）を無効にする設定およびGoogle
      Adsenseに関する詳細は
      <a href="https://policies.google.com/technologies/ads?hl=ja">
        こちらのページ
      </a>
      をご覧ください。
    </p>
    <h2>免責事項</h2>
    <p>
      当サイトからリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任を負いません。
      運営者は、当サイトの内容によって生じた損害・トラブル等の一切の責任を負いかねますのでご了承ください。
      また、当サイトはソフトウェア等の不具合が発生しないことを一切保証しないものとします。
    </p>
    <h2>プライバシーポリシーの変更</h2>
    <p>
      当サイトは、個人情報に関して適用される日本の法令を遵守するとともに、本ポリシーの内容を適宜見直しその改善に努めます。修正された最新のプライバシーポリシーは常に本ページにて開示されます。
    </p>
    <h2>係争について</h2>
    <p>
      当サイトの利用ならびに当サイトの内容の解釈については、日本国の法律を準拠法とします。また、このサイトに関わる全ての紛争については、日本国の東京地方裁判所を第一審の専属管轄裁判所とします。
    </p>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'
export default Vue.extend({})
</script>
